In [1]:
# librerias

import pandas as pd
pd.set_option('display.max_columns', None)

import numpy as np

import warnings
warnings.filterwarnings('ignore')


# para pintar
import pylab as plt
import seaborn as sns

#para que salga el grafico
%matplotlib inline

In [2]:
# Cargamos los datos

actor=pd.read_csv('./Proyecto-SQL/data/actor.csv')
category=pd.read_csv('./Proyecto-SQL/data/category.csv')
film=pd.read_csv('./Proyecto-SQL/data/film.csv')
inventory=pd.read_csv('./Proyecto-SQL/data/inventory.csv')
language=pd.read_csv('./Proyecto-SQL/data/language.csv')
old_HDD=pd.read_csv('./Proyecto-SQL/data/old_HDD.csv')
rental=pd.read_csv('./Proyecto-SQL/data/rental.csv')

In [3]:
#Analizamos los datos del primer dataframe, para compropar si existen valores nulos o duplicados
actor.shape

(200, 4)

In [4]:
nan_cols=actor.isna().sum()  # serie con los valores nulos por columna

nan_cols[nan_cols>0]

Series([], dtype: int64)

In [5]:
# comprobamos duplicados

actor.duplicated().any()

False

In [6]:
actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [7]:
actor.actor_id.unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104,
       105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117,
       118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
       131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143,
       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156,
       157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169,
       170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182,
       183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195,
       196, 197, 198, 199, 200], dtype=int64)

In [8]:
actor.last_update.value_counts()

2006-02-15 04:34:33    200
Name: last_update, dtype: int64

In [9]:
#Quitamos la columna last_update, ya que no nos proporciona ning√∫n valor necesario
actor.drop(columns='last_update', inplace=True)

In [10]:
actor.head()

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA

In [11]:
#Finalmente pasamos a reducir el espacio en memoria
actor.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   actor_id    200 non-null    int64
 1   first_name  200 non-null    object
 2   last_name   200 non-null    object
dtypes: int64(1), object(2)
memory usage: 26.2 KB

In [12]:
for c in actor.select_dtypes('integer').columns:
    
    actor[c]=pd.to_numeric(actor[c], downcast='integer')
    
actor.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   actor_id    200 non-null    int16
 1   first_name  200 non-null    object
 2   last_name   200 non-null    object
dtypes: int16(1), object(2)
memory usage: 25.0 KB

## category

In [13]:
#Quitamos la columna last_update, ya que no nos proporciona ning√∫n valor necesario
category.drop(columns='last_update', inplace=True)

In [14]:
category

    category_id         name
0             1       Action
1             2    Animation
2             3     Children
3             4     Classics
4             5       Comedy
5             6  Documentary
6             7        Drama
7             8       Family
8             9      Foreign
9            10        Games
10           11       Horror
11           12        Music
12           13          New
13           14       Sci-Fi
14           15       Sports
15           16       Travel

In [15]:
#Finalmente pasamos a reducir el espacio en memoria
category.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
dtypes: int64(1), object(1)
memory usage: 1.2 KB

In [16]:
for c in category.select_dtypes('integer').columns:
    
    category[c]=pd.to_numeric(category[c], downcast='integer')
    
category.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int8
 1   name         16 non-null     object
dtypes: int8(1), object(1)
memory usage: 1.1 KB

## film

In [17]:
film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [18]:
len(film)

1000

In [19]:
# comprobamos duplicados

actor.duplicated().any()

False

In [20]:
#Vamos a ir comprobando los valores unicos por columnas

In [21]:
film.release_year.value_counts()

2006    1000
Name: release_year, dtype: int64

In [22]:
film.language_id.value_counts()

1    1000
Name: language_id, dtype: int64

In [23]:
film.rating.value_counts()

PG-13    223
NC-17    210
R        195
PG       194
G        178
Name: rating, dtype: int64

In [24]:
film.special_features.value_counts()

Trailers,Commentaries,Behind the Scenes                   79
Trailers                                                  72
Trailers,Commentaries                                     72
Trailers,Behind the Scenes                                72
Deleted Scenes,Behind the Scenes                          71
Commentaries,Behind the Scenes                            70
Behind the Scenes                                         70
Trailers,Deleted Scenes                                   66
Commentaries,Deleted Scenes,Behind the Scenes             66
Commentaries,Deleted Scenes                               65
Trailers,Commentaries,Deleted Scenes                      64
Commentaries                                              62
Deleted Scenes                                            61
Trailers,Commentaries,Deleted Scenes,Behind the Scenes    61
Trailers,Deleted Scenes,Behind the Scenes                 49
Name: special_features, dtype: int64

In [25]:
film.last_update.value_counts()

2006-02-15 05:03:42    1000
Name: last_update, dtype: int64

In [26]:
#Ahora vamos a comprobar los valores nulos por columna en el Dataframe
nan_cols=film.isna().sum()  

nan_cols[nan_cols>0]

original_language_id    1000
dtype: int64

In [27]:
#Retiramos columnas que no necesitamos
film.drop(columns=['original_language_id','last_update'], inplace=True)

In [28]:
film.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes

In [29]:
#Finalmente pasamos a reducir el espacio en memoria
film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   release_year      1000 non-null   int64
 4   language_id       1000 non-null   int64
 5   rental_duration   1000 non-null   int64
 6   rental_rate       1000 non-null   float64
 7   length            1000 non-null   int64
 8   replacement_cost  1000 non-null   float64
 9   rating            1000 non-null   object
 10  special_features  1000 non-null   object
dtypes: float64(2), int64(5), object(4)
memory usage: 413.3 KB

In [30]:
for c in film.select_dtypes('integer').columns:
    
    film[c]=pd.to_numeric(film[c], downcast='integer')
    
film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int16
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   release_year      1000 non-null   int16
 4   language_id       1000 non-null   int8
 5   rental_duration   1000 non-null   int8
 6   rental_rate       1000 non-null   float64
 7   length            1000 non-null   int16
 8   replacement_cost  1000 non-null   float64
 9   rating            1000 non-null   object
 10  special_features  1000 non-null   object
dtypes: float64(2), int16(3), int8(2), object(4)
memory usage: 382.0 KB

In [31]:
for c in film.select_dtypes('float').columns:
    
    film[c]=pd.to_numeric(film[c], downcast='float')
    
film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int16
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   release_year      1000 non-null   int16
 4   language_id       1000 non-null   int8
 5   rental_duration   1000 non-null   int8
 6   rental_rate       1000 non-null   float32
 7   length            1000 non-null   int16
 8   replacement_cost  1000 non-null   float32
 9   rating            1000 non-null   object
 10  special_features  1000 non-null   object
dtypes: float32(2), int16(3), int8(2), object(4)
memory usage: 374.2 KB

## inventory

In [32]:
inventory

     inventory_id  film_id  store_id          last_update
0               1        1         1  2006-02-15 05:09:17
1               2        1         1  2006-02-15 05:09:17
2               3        1         1  2006-02-15 05:09:17
3               4        1         1  2006-02-15 05:09:17
4               5        1         2  2006-02-15 05:09:17
..            ...      ...       ...                  ...
995           996      222         2  2006-02-15 05:09:17
996           997      222         2  2006-02-15 05:09:17
997           998      222         2  2006-02-15 05:09:17
998           999      223         2  2006-02-15 05:09:17
999          1000      223         2  2006-02-15 05:09:17

[1000 rows x 4 columns]

In [33]:
inventory.duplicated().any()

False

In [34]:
#Quitamos la columna last_update, ya que no nos proporciona ning√∫n valor necesario
inventory.drop(columns='last_update', inplace=True)

In [35]:
inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

In [36]:
#Finalmente pasamos a reducir el espacio en memoria
inventory.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
dtypes: int64(3)
memory usage: 23.6 KB

In [37]:
for c in inventory.select_dtypes('integer').columns:
    
    inventory[c]=pd.to_numeric(inventory[c], downcast='integer')
    
inventory.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int16
 1   film_id       1000 non-null   int16
 2   store_id      1000 non-null   int8
dtypes: int16(2), int8(1)
memory usage: 5.0 KB

## language

In [38]:
language

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [44]:
#Quitamos la columna last_update, ya que no nos proporciona ning√∫n valor necesario
language.drop(columns='last_update', inplace=True)

In [46]:
language

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French
5            6    German

In [47]:
#Finalmente pasamos a reducir el espacio en memoria
language.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int8
 1   name         6 non-null      object
dtypes: int8(1), object(1)
memory usage: 518.0 bytes

In [48]:
for c in language.select_dtypes('integer').columns:
    
    language[c]=pd.to_numeric(language[c], downcast='integer')
    
language.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int8
 1   name         6 non-null      object
dtypes: int8(1), object(1)
memory usage: 518.0 bytes

## old_HDD

In [49]:
old_HDD

    first_name last_name                  title  release_year  category_id
0     PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1     PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2     PENELOPE   GUINESS            ANGELS LIFE          2006           13
3     PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4     PENELOPE   GUINESS          CHEAPER CLYDE          2006           14
..         ...       ...                    ...           ...          ...
995     GOLDIE     BRODY      COMANCHEROS ENEMY          2006            3
996     GOLDIE     BRODY        DAISY MENAGERIE          2006           14
997     GOLDIE     BRODY        DESERT POSEIDON          2006           11
998     GOLDIE     BRODY         EVERYONE CRAFT          2006            9
999     GOLDIE     BRODY         EXORCIST STING          2006           15

[1000 rows x 5 columns]

In [50]:
old_HDD.duplicated().any()

False

In [53]:
old_HDD.first_name.value_counts()

SANDRA       56
VAL          35
UMA          35
JULIA        33
RIP          33
HELEN        32
KARL         31
WOODY        31
VIVIEN       30
LUCILLE      30
GRACE        30
JOHNNY       29
BURT         29
ALEC         29
CUBA         28
KIRSTEN      27
FRED         27
ELVIS        26
ZERO         25
BOB          25
NICK         25
AUDREY       25
JOE          25
TOM          25
MILLA        24
CAMERON      24
TIM          23
DAN          22
ED           22
JENNIFER     22
CHRISTIAN    22
KEVIN        21
MATTHEW      20
BETTE        20
PENELOPE     19
SISSY        18
JUDY         15
GOLDIE        7
Name: first_name, dtype: int64

In [54]:
old_HDD.last_name.value_counts()

OLIVIER         53
PECK            43
KILMER          37
BOLGER          35
WOOD            35
MCQUEEN         33
CRAWFORD        33
VOIGHT          32
BERRY           31
HOFFMAN         31
BERGEN          30
MOSTEL          30
TRACY           30
WAYNE           29
DUKAKIS         29
LOLLOBRIGIDA    29
PALTROW         27
COSTNER         27
MARX            26
MCKELLEN        25
SWANK           25
WAHLBERG        25
CAGE            25
FAWCETT         25
STREEP          24
HACKMAN         23
GABLE           22
DAVIS           22
TORN            22
CHASE           22
BLOOM           21
NICHOLSON       20
JOHANSSON       20
GUINESS         19
SOBIESKI        18
DEAN            15
BRODY            7
Name: last_name, dtype: int64

In [55]:
len(old_HDD.first_name)== len(old_HDD.last_name)

True

In [57]:
old_HDD.title.value_counts().head()

BOONDOCK BALLROOM     6
FLASH WARS            5
STRANGER STRANGERS    5
OKLAHOMA JUMANJI      5
CHITTY LOCK           5
Name: title, dtype: int64

In [58]:
#Finalmente pasamos a reducir el espacio en memoria
old_HDD.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 207.6 KB

In [59]:
for c in old_HDD.select_dtypes('integer').columns:
    
    old_HDD[c]=pd.to_numeric(old_HDD[c], downcast='integer')
    
old_HDD.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int16
 4   category_id   1000 non-null   int8
dtypes: int16(1), int8(1), object(3)
memory usage: 194.9 KB

## rental

In [60]:
rental

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
995,997,2005-05-31 00:08:25,4243,216,2005-06-02 00:17:25,2,2006-02-15 21:30:53
996,998,2005-05-31 00:16:57,3395,389,2005-06-01 22:41:57,1,2006-02-15 21:30:53
997,999,2005-05-31 00:25:10,4433,413,2005-06-03 06:05:10,2,2006-02-15 21:30:53
998,1000,2005-05-31 00:25:56,1774,332,2005-06-08 19:42:56,2,2006-02-15 21:30:53
999,1001,2005-05-31 00:46:31,1498,64,2005-06-06 06:14:31,2,2006-02-15 21:30:53

In [61]:
rental.duplicated().any()

False

In [63]:
numero=list(range(1,1001))
rental.rental_id=numero

In [65]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [67]:
#Quitamos la columna last_update, ya que no nos proporciona ning√∫n valor necesario
rental.drop(columns='last_update', inplace=True)

In [68]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [69]:
#Finalmente pasamos a reducir el espacio en memoria
rental.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
dtypes: int64(4), object(2)
memory usage: 179.8 KB

In [70]:
for c in rental.select_dtypes('integer').columns:
    
    rental[c]=pd.to_numeric(rental[c], downcast='integer')
    
rental.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int16
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int16
 3   customer_id   1000 non-null   int16
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int8
dtypes: int16(3), int8(1), object(2)
memory usage: 155.4 KB

## Extracci√≥n de deatos

In [71]:
actor.to_csv('./Proyecto-SQL/data_limpio/actor.csv', index=False)
category.to_csv('./Proyecto-SQL/data_limpio/category.csv', index=False)
film.to_csv('./Proyecto-SQL/data_limpio/film.csv', index=False)
inventory.to_csv('./Proyecto-SQL/data_limpio/inventory.csv', index=False)
language.to_csv('./Proyecto-SQL/data_limpio/language.csv', index=False)
old_HDD.to_csv('./Proyecto-SQL/data_limpio/old_HDD.csv', index=False)
rental.to_csv('./Proyecto-SQL/data_limpio/rental.csv', index=False)